
   #### Read each of the files in the list data_files into a pandas dataframe using the pandas.read_csv() function.
   ####     Recall that all of the data sets are in the schools folder. That means the path to ap_2010.csv is schools/ap_2010.csv.
   #### Add each of the dataframes to the dictionary data, using the base of the filename as the key. For example, you'd enter ap_2010 for the file ap_2010.csv.
  ####  Afterwards, data should have the following keys:
   ####   ap_2010
  ####     class_size
  ####    demographics
 ####     graduation
####       hs_directory
 ####      sat_results
 ####  In addition, each key in data should have the corresponding dataframe as its value.

In [17]:
# import libraries
import pandas as pd

# create a list of the dataset files
data_files = [
    "ap_2010.csv",
    "class_size.csv",
    "demographics.csv",
    "graduation.csv",
    "hs_directory.csv",
    "sat_results.csv"
]
# create an empty dictionary
data = {}

# Read the data_files list into dataframes and add them to the dictionary
for f in data_files:
    d =  pd.read_csv("C:/Users/STELLAS MFB IT/Desktop/p/schools/{0}".format(f))
    key_name = f.replace(".csv","")
    data[key_name] = d

#### Display the first five rows of the SAT scores data.

####  Use the key sat_results to access the SAT scores dataframe stored in the dictionary data.
####   Use the pandas.DataFrame.head() method  to display the first five rows of the dataframe.

In [18]:
# Display 5 rows of sat resullts from dictionary data
data["sat_results"].head()

,DBN,SCHOOL NAME,Num of SAT Test Takers,SAT Critical Reading Avg. Score,SAT Math Avg. Score,SAT Writing Avg. Score
0,01M292,HENRY STREET SCHOOL FOR INTERNATIONAL STUDIES,29,355,404,363
1,01M448,UNIVERSITY NEIGHBORHOOD HIGH SCHOOL,91,383,423,366
2,01M450,EAST SIDE COMMUNITY SCHOOL,70,377,402,370
3,01M458,FORSYTH SATELLITE ACADEMY,7,414,401,359
4,01M509,MARTA VALLE HIGH SCHOOL,44,390,433,384

#### Loop through each key in data. For each key:

####  Display the first five rows of the dataframe associated with the key.

In [19]:
for key in data:
    print(data[key].head())

      DBN                             SchoolName  AP Test Takers   \
0  01M448           UNIVERSITY NEIGHBORHOOD H.S.             39.0
1  01M450                 EAST SIDE COMMUNITY HS             19.0
2  01M515                    LOWER EASTSIDE PREP             24.0
3  01M539         NEW EXPLORATIONS SCI,TECH,MATH            255.0
4  02M296  High School of Hospitality Management              NaN

   Total Exams Taken  Number of Exams with scores 3 4 or 5
0               49.0                                  10.0
1               21.0                                   NaN
2               26.0                                  24.0
3              377.0                                 191.0
4                NaN                                   NaN
   CSD BOROUGH SCHOOL CODE                SCHOOL NAME GRADE  PROGRAM TYPE  \
0    1       M        M015  P.S. 015 Roberto Clemente     0K       GEN ED
1    1       M        M015  P.S. 015 Roberto Clemente     0K          CTT
2    1       M        M015  P.S. 015 Roberto Clemente     01       GEN ED
3    1       M        M015  P.S. 015 Roberto Clemente     01          CTT
4    1       M        M015  P.S. 015 Roberto Clemente     02       GEN ED

  CORE SUBJECT (MS CORE and 9-12 ONLY) CORE COURSE (MS CORE and 9-12 ONLY)  \
0                                    -                                   -
1                                    -                                   -
2                                    -                                   -
3                                    -                                   -
4                                    -                                   -

  SERVICE CATEGORY(K-9* ONLY)  NUMBER OF STUDENTS / SEATS FILLED  \
0                           -                               19.0
1                           -                               21.0
2                           -                               17.0
3                           -                               17.0
4                           -                               15.0

   NUMBER OF SECTIONS  AVERAGE CLASS SIZE  SIZE OF SMALLEST CLASS  \
0                 1.0                19.0                    19.0
1                 1.0                21.0                    21.0
2                 1.0                17.0                    17.0
3                 1.0                17.0                    17.0
4                 1.0                15.0                    15.0

   SIZE OF LARGEST CLASS DATA SOURCE  SCHOOLWIDE PUPIL-TEACHER RATIO
0                   19.0         ATS                             NaN
1                   21.0         ATS                             NaN
2                   17.0         ATS                             NaN
3                   17.0         ATS                             NaN
4                   15.0         ATS                             NaN
      DBN                       Name  schoolyear fl_percent  frl_percent  \
0  01M015  P.S. 015 ROBERTO CLEMENTE    20052006       89.4          NaN
1  01M015  P.S. 015 ROBERTO CLEMENTE    20062007       89.4          NaN
2  01M015  P.S. 015 ROBERTO CLEMENTE    20072008       89.4          NaN
3  01M015  P.S. 015 ROBERTO CLEMENTE    20082009       89.4          NaN
4  01M015  P.S. 015 ROBERTO CLEMENTE    20092010                    96.5

   total_enrollment prek   k grade1 grade2  ... black_num black_per  \
0               281   15  36     40     33  ...        74      26.3
1               243   15  29     39     38  ...        68      28.0
2               261   18  43     39     36  ...        77      29.5
3               252   17  37     44     32  ...        75      29.8
4               208   16  40     28     32  ...        67      32.2

  hispanic_num hispanic_per white_num white_per male_num male_per female_num  \
0          189         67.3         5       1.8    158.0     56.2      123.0
1          153         63.0         4       1.6    140.0     57.6      103.0
2          157         60.2         7       2.7    143.0     54.8      118.0
3          149         59.1         7       2.8    149.0     59.1      103.0
4          118         56.7         6       2.9    124.0     59.6       84.0

  female_per
0       43.8
1       42.4
2       45.2
3       40.9
4       40.4

[5 rows x 38 columns]
    Demographic     DBN                            School Name    Cohort  \
0  Total Cohort  01M292  HENRY STREET SCHOOL FOR INTERNATIONAL      2003
1  Total Cohort  01M292  HENRY STREET SCHOOL FOR INTERNATIONAL      2004
2  Total Cohort  01M292  HENRY STREET SCHOOL FOR INTERNATIONAL      2005
3  Total Cohort  01M292  HENRY STREET SCHOOL FOR INTERNATIONAL      2006
4  Total Cohort  01M292  HENRY STREET SCHOOL FOR INTERNATIONAL  2006 Aug

   Total Cohort Total Grads - n  Total Grads - % of cohort Total Regents - n  \
0             5               s                        NaN                 s
1            55              37                       67.3                17
2            64              43                       67.2                27
3            78              43                       55.1                36
4            78              44                       56.4                37

   Total Regents - % of cohort  Total Regents - % of grads  ...  \
0                          NaN                         NaN  ...
1                         30.9                        45.9  ...
2                         42.2                        62.8  ...
3                         46.2                        83.7  ...
4                         47.4                        84.1  ...

  Regents w/o Advanced - n  Regents w/o Advanced - % of cohort  \
0                        s                                 NaN
1                       17                                30.9
2                       27                                42.2
3                       36                                46.2
4                       37                                47.4

   Regents w/o Advanced - % of grads Local - n  Local - % of cohort  \
0                                NaN         s                  NaN
1                               45.9        20                 36.4
2                               62.8        16                 25.0
3                               83.7         7                  9.0
4                               84.1         7                  9.0

   Local - % of grads Still Enrolled - n  Still Enrolled - % of cohort  \
0                 NaN                  s                           NaN
1                54.1                 15                          27.3
2                37.2                  9                          14.1
3                16.3                 16                          20.5
4                15.9                 15                          19.2

   Dropped Out - n Dropped Out - % of cohort
0                s                       NaN
1                3                       5.5
2                9                      14.1
3               11                      14.1
4               11                      14.1

[5 rows x 23 columns]
      dbn                                        school_name    borough  \
0  21K540                             John Dewey High School   Brooklyn
1  15K429                 Brooklyn School for Global Studies   Brooklyn
2  24Q530  International High School at LaGuardia Communi...     Queens
3  05M367  Academy for Social Action: A College Board School  Manhattan
4  27Q260          Frederick Douglass Academy VI High School     Queens

  building_code  phone_number    fax_number  grade_span_min  grade_span_max  \
0          K540  718-373-6400  718-266-4385             9.0              12
1          K293  718-694-9741  718-694-9745             6.0              12
2          Q520  718-392-3433  718-392-3443             9.0              12
3          M043  212-234-3102  212-234-8597             9.0              12
4          Q465  718-471-2154  718-471-2890             9.0              12

   expgrade_span_min  expgrade_span_max  ... priority08 priority09 priority10  \
0                NaN                NaN  ...        NaN        NaN        NaN
1                NaN                NaN  ...        NaN        NaN        NaN
2                NaN                NaN  ...        NaN        NaN        NaN
3                NaN                NaN  ...        NaN        NaN        NaN
4                NaN                NaN  ...        NaN        NaN        NaN

                                          Location 1 Community Board  \
0  50 Avenue\nX Brooklyn, NY 11223\n(40.589238098...            13.0
1  284 Baltic Street\nBrooklyn, NY 11201\n(40.685...             6.0
2  45 35 Van Dam Street\nLong Island City, NY 111...             2.0
3  509 West 129 Street\nNew York, NY 10027\n(40.8...             9.0
4  8 21 Bay 25 Street\nFar Rockaway, NY 11691\n(4...            14.0

   Council District Census Tract        BIN           BBL  \
0              47.0        308.0  3194998.0  3.071850e+09
1              33.0         69.0  3006401.0  3.004020e+09
2              26.0        179.0  4003442.0  4.002490e+09
3               7.0        219.0  1059723.0  1.019840e+09
4              31.0     100802.0  4300730.0  4.157360e+09

                                                 NTA
0  Gravesend                                     ...
1  DUMBO-Vinegar Hill-Downtown Brooklyn-Boerum Hi...
2  Hunters Point-Sunnyside-West Maspeth          ...
3  Manhattanville                                ...
4  Far Rockaway-Bayswater                        ...

[5 rows x 64 columns]
      DBN                                    SCHOOL NAME  \
0  01M292  HENRY STREET SCHOOL FOR INTERNATIONAL STUDIES
1  01M448            UNIVERSITY NEIGHBORHOOD HIGH SCHOOL
2  01M450                     EAST SIDE COMMUNITY SCHOOL
3  01M458                      FORSYTH SATELLITE ACADEMY
4  01M509                        MARTA VALLE HIGH SCHOOL

  Num of SAT Test Takers SAT Critical Reading Avg. Score SAT Math Avg. Score  \
0                     29                             355                 404
1                     91                             383                 423
2                     70                             377                 402
3                      7                             414                 401
4                     44                             390                 433

  SAT Writing Avg. Score
0                    363
1                    366
2                    370
3                    359
4                    384


   #### Read in survey_all.txt.
   ####    Use the pandas.read_csv() function to read survey_all.txt into the variable all_survey. Recall that this file is located in the schools folder.
   ####        Specify the keyword argument delimiter="\t".
   ####        Specify the keyword argument encoding="windows-1252".
  ####   Read in survey_d75.txt.
  ####      Use the pandas.read_csv() function to read schools/survey_d75.txt into the variable d75_survey. Recall that this file is located in the schools folder.
   ####        Specify the keyword argument delimiter="\t".
   ####        Specify the keyword argument encoding="windows-1252".
   #### Combine d75_survey and all_survey into a single dataframe.
   ####     Use the pandas concat() function with the keyword argument axis=0 to combine d75_survey and all_survey into the dataframe survey.
   ####     Pass in all_survey first, then d75_survey when calling the pandas.concat() function.
   #### Display the first five rows of survey using the pandas.DataFrame.head() function.

In [20]:
# reading survey_all.txt and survey_d75.txt files into Dataframes
all_survey = pd.read_csv("C:/Users/STELLAS MFB IT/Desktop/p/schools/survey_all.txt",delimiter = "\t",encoding = "windows-1252")
d75_survey = pd.read_csv("C:/Users/STELLAS MFB IT/Desktop/p/schools/survey_d75.txt",delimiter = "\t",encoding = "windows-1252")

In [21]:
# combining the two files into a single dataframe.
survey = pd.concat([all_survey,d75_survey],axis = 0,sort = True)
# display 5 rows of the combined file
survey.head()

,N_p,N_s,N_t,aca_p_11,aca_s_11,aca_t_11,aca_tot_11,bn,com_p_11,com_s_11,...,t_q8c_1,t_q8c_2,t_q8c_3,t_q8c_4,t_q9,t_q9_1,t_q9_2,t_q9_3,t_q9_4,t_q9_5
0,90.0,NaN,22.0,7.8,NaN,7.9,7.9,M015,7.6,NaN,...,29.0,67.0,5.0,0.0,NaN,5.0,14.0,52.0,24.0,5.0
1,161.0,NaN,34.0,7.8,NaN,9.1,8.4,M019,7.6,NaN,...,74.0,21.0,6.0,0.0,NaN,3.0,6.0,3.0,78.0,9.0
2,367.0,NaN,42.0,8.6,NaN,7.5,8.0,M020,8.3,NaN,...,33.0,35.0,20.0,13.0,NaN,3.0,5.0,16.0,70.0,5.0
3,151.0,145.0,29.0,8.5,7.4,7.8,7.9,M034,8.2,5.9,...,21.0,45.0,28.0,7.0,NaN,0.0,18.0,32.0,39.0,11.0
4,90.0,NaN,23.0,7.9,NaN,8.1,8.0,M063,7.9,NaN,...,59.0,36.0,5.0,0.0,NaN,10.0,5.0,10.0,60.0,15.0


  ####  Copy the data from the dbn column of survey into a new column in survey called DBN.
  ####  Filter survey so it only contains the columns we listed above. You can do this using pandas.DataFrame.loc[].
  ####      Remember that we renamed dbn to DBN; be sure to change the list of columns we want to keep accordingly.
  ####  Assign the dataframe survey to the key survey in the dictionary data.
  ####  When you're finished, the value in data["survey"] should be a dataframe with 23 columns and 1702 rows.

In [22]:
# create a new column called 'DBN' and copy column 'dbn' into it
survey['DBN'] = survey['dbn']

# create a list of the columns to filter
survey_fields = [
    "DBN", 
    "rr_s", 
    "rr_t", 
    "rr_p", 
    "N_s", 
    "N_t", 
    "N_p", 
    "saf_p_11", 
    "com_p_11", 
    "eng_p_11", 
    "aca_p_11", 
    "saf_t_11", 
    "com_t_11", 
    "eng_t_11", 
    "aca_t_11", 
    "saf_s_11", 
    "com_s_11", 
    "eng_s_11", 
    "aca_s_11", 
    "saf_tot_11", 
    "com_tot_11", 
    "eng_tot_11", 
    "aca_tot_11",
]

# filter the columns
survey = survey.loc[:,survey_fields]

# add the filtered data to the data dictionary
data["survey"] = survey

survey.head()

,DBN,rr_s,rr_t,rr_p,N_s,N_t,N_p,saf_p_11,com_p_11,eng_p_11,...,eng_t_11,aca_t_11,saf_s_11,com_s_11,eng_s_11,aca_s_11,saf_tot_11,com_tot_11,eng_tot_11,aca_tot_11
0,01M015,NaN,88,60,NaN,22.0,90.0,8.5,7.6,7.5,...,7.6,7.9,NaN,NaN,NaN,NaN,8.0,7.7,7.5,7.9
1,01M019,NaN,100,60,NaN,34.0,161.0,8.4,7.6,7.6,...,8.9,9.1,NaN,NaN,NaN,NaN,8.5,8.1,8.2,8.4
2,01M020,NaN,88,73,NaN,42.0,367.0,8.9,8.3,8.3,...,6.8,7.5,NaN,NaN,NaN,NaN,8.2,7.3,7.5,8.0
3,01M034,89.0,73,50,145.0,29.0,151.0,8.8,8.2,8.0,...,6.8,7.8,6.2,5.9,6.5,7.4,7.3,6.7,7.1,7.9
4,01M063,NaN,100,60,NaN,23.0,90.0,8.7,7.9,8.1,...,7.8,8.1,NaN,NaN,NaN,NaN,8.5,7.6,7.9,8.0


  ####  Copy the dbn column in hs_directory into a new column called DBN.
 ####   Create a new column called padded_csd in the class_size data set.
  ####      Use the pandas.Series.apply() method along with a custom function to generate this column.
  ####          Make sure to apply the function along the data["class_size"]["CSD"] column.
  ####  Use the addition operator (+) along with the padded_csd and SCHOOL CODE columns of class_size, then assign the result to the DBN column of class_size.
 ####   Display the first few rows of class_size to double check the DBN column.

In [23]:
# create a new column 'DBN' in dataset hs_directory and copy column 'dbn' into it.
data['hs_directory']['DBN'] = data['hs_directory']['dbn']

# create a function that will cnvert a number to string and pad it with zero if it is less and 2
def pad_csd(num):
    return str(num).zfill(2)

# apply the function to column 'CSD' in class_size and assign the result to column 'padded_csd'
data['class_size']['padded_csd']= data['class_size']['CSD'].apply(pad_csd)

#combine column 'padded_csd' and 'SCHOOL CODE' in class_size dataset and assign the result to column 'DBN'
data['class_size']['DBN'] = data['class_size']['padded_csd']+ data['class_size']['SCHOOL CODE']

data['class_size'].head()

,CSD,BOROUGH,SCHOOL CODE,SCHOOL NAME,GRADE,PROGRAM TYPE,CORE SUBJECT (MS CORE and 9-12 ONLY),CORE COURSE (MS CORE and 9-12 ONLY),SERVICE CATEGORY(K-9* ONLY),NUMBER OF STUDENTS / SEATS FILLED,NUMBER OF SECTIONS,AVERAGE CLASS SIZE,SIZE OF SMALLEST CLASS,SIZE OF LARGEST CLASS,DATA SOURCE,SCHOOLWIDE PUPIL-TEACHER RATIO,padded_csd,DBN
0,1,M,M015,P.S. 015 Roberto Clemente,0K,GEN ED,-,-,-,19.0,1.0,19.0,19.0,19.0,ATS,NaN,01,01M015
1,1,M,M015,P.S. 015 Roberto Clemente,0K,CTT,-,-,-,21.0,1.0,21.0,21.0,21.0,ATS,NaN,01,01M015
2,1,M,M015,P.S. 015 Roberto Clemente,01,GEN ED,-,-,-,17.0,1.0,17.0,17.0,17.0,ATS,NaN,01,01M015
3,1,M,M015,P.S. 015 Roberto Clemente,01,CTT,-,-,-,17.0,1.0,17.0,17.0,17.0,ATS,NaN,01,01M015
4,1,M,M015,P.S. 015 Roberto Clemente,02,GEN ED,-,-,-,15.0,1.0,15.0,15.0,15.0,ATS,NaN,01,01M015


  ####  Convert the SAT Math Avg. Score, SAT Critical Reading Avg. Score, and SAT Writing Avg. Score columns in the sat_results data set from the object (string) data type to a numeric data type.
 ####       Use the pandas.to_numeric() function on each of the columns, and assign the result back to the same column.
 ####       Pass in the keyword argument errors="coerce".
 ####   Create a column called sat_score in sat_results that holds the combined SAT score for each student.
 ####       Add up SAT Math Avg. Score, SAT Critical Reading Avg. Score, and SAT Writing Avg. Score, and assign the total to the sat_score column of sat_results.
 ####   Display the first few rows of the sat_score column of sat_results to verify that everything went okay.

In [24]:
# Create a list of the three columns
cols = ['SAT Math Avg. Score','SAT Critical Reading Avg. Score','SAT Writing Avg. Score']

#loop through the list and convert each element to numeric
for c in cols:
    data['sat_results'][c] = pd.to_numeric(data['sat_results'][c], errors = "coerce")
    
#Add up the scores and assgn them to a new created column called sat_score in sat_results
data['sat_results']['sat_score'] = data['sat_results'][cols[0]] + data['sat_results'][cols[1]] + data['sat_results'][cols[2]]

print(data['sat_results']['sat_score'].head())

0    1122.0
1    1172.0
2    1149.0
3    1174.0
4    1207.0
Name: sat_score, dtype: float64

In [25]:
 import re
 re.findall("\(.+\)", "1110 Boston Road\nBronx, NY 10456\n(40.8276026690005, -73.90447525699966)")

['(40.8276026690005, -73.90447525699966)']


  ####  Write a function that:
  ####      Takes in a string
   ####     Uses the regular expression above to extract the coordinates
  ####      Uses string manipulation functions to pull out the latitude
  ####      Returns the latitude
  ####  Use the Series.apply() method to apply the function across the Location 1 column of hs_directory. Assign the result to the lat column of hs_directory.
 ####   Display the first few rows of hs_directory to verify the results.

In [26]:
import re

def find_lat(loc):
    coords = re.findall("\(.+\)", loc)
    lat = coords[0].split(",")[0].replace("(","")
    return lat

data["hs_directory"]["lat"] = data["hs_directory"]["Location 1"].apply(find_lat)
data["hs_directory"].head()

,dbn,school_name,borough,building_code,phone_number,fax_number,grade_span_min,grade_span_max,expgrade_span_min,expgrade_span_max,...,priority10,Location 1,Community Board,Council District,Census Tract,BIN,BBL,NTA,DBN,lat
0,21K540,John Dewey High School,Brooklyn,K540,718-373-6400,718-266-4385,9.0,12,NaN,NaN,...,NaN,"50 Avenue\nX Brooklyn, NY 11223\n(40.589238098...",13.0,47.0,308.0,3194998.0,3.071850e+09,Gravesend ...,21K540,40.589238098
1,15K429,Brooklyn School for Global Studies,Brooklyn,K293,718-694-9741,718-694-9745,6.0,12,NaN,NaN,...,NaN,"284 Baltic Street\nBrooklyn, NY 11201\n(40.685...",6.0,33.0,69.0,3006401.0,3.004020e+09,DUMBO-Vinegar Hill-Downtown Brooklyn-Boerum Hi...,15K429,40.685451806
2,24Q530,International High School at LaGuardia Communi...,Queens,Q520,718-392-3433,718-392-3443,9.0,12,NaN,NaN,...,NaN,"45 35 Van Dam Street\nLong Island City, NY 111...",2.0,26.0,179.0,4003442.0,4.002490e+09,Hunters Point-Sunnyside-West Maspeth ...,24Q530,40.744149536
3,05M367,Academy for Social Action: A College Board School,Manhattan,M043,212-234-3102,212-234-8597,9.0,12,NaN,NaN,...,NaN,"509 West 129 Street\nNew York, NY 10027\n(40.8...",9.0,7.0,219.0,1059723.0,1.019840e+09,Manhattanville ...,05M367,40.815230365
4,27Q260,Frederick Douglass Academy VI High School,Queens,Q465,718-471-2154,718-471-2890,9.0,12,NaN,NaN,...,NaN,"8 21 Bay 25 Street\nFar Rockaway, NY 11691\n(4...",14.0,31.0,100802.0,4300730.0,4.157360e+09,Far Rockaway-Bayswater ...,27Q260,40.601989336


   #### Write a function that:
   ####     Takes in a string.
   ####     Uses the regular expression on the previous screen to extract the coordinates.
   ####     Uses string manipulation functions to pull out the longitude.
   ####     Returns the longitude.
   #### Use the Series.apply() method to apply the function across the Location 1 column of hs_directory. Assign the result to the lon column of hs_directory.
  ####  Use the to_numeric() function to convert the lat and lon columns of hs_directory to numbers.
  ####      Specify the errors="coerce" keyword argument to handle missing values properly.
   #### Display the first few rows of hs_directory to verify the results.

In [27]:
def find_lon(loc):
    coords = re.findall("\(.+\)", loc)
    lon = coords[0].split(",")[1].replace(")", "").strip()
    return lon

data["hs_directory"]["lon"] = data["hs_directory"]["Location 1"].apply(find_lon)

data["hs_directory"]["lat"] = pd.to_numeric(data["hs_directory"]["lat"], errors="coerce")
data["hs_directory"]["lon"] = pd.to_numeric(data["hs_directory"]["lon"], errors="coerce")

print(data["hs_directory"].head())

      dbn                                        school_name    borough  \
0  21K540                             John Dewey High School   Brooklyn
1  15K429                 Brooklyn School for Global Studies   Brooklyn
2  24Q530  International High School at LaGuardia Communi...     Queens
3  05M367  Academy for Social Action: A College Board School  Manhattan
4  27Q260          Frederick Douglass Academy VI High School     Queens

  building_code  phone_number    fax_number  grade_span_min  grade_span_max  \
0          K540  718-373-6400  718-266-4385             9.0              12
1          K293  718-694-9741  718-694-9745             6.0              12
2          Q520  718-392-3433  718-392-3443             9.0              12
3          M043  212-234-3102  212-234-8597             9.0              12
4          Q465  718-471-2154  718-471-2890             9.0              12

   expgrade_span_min  expgrade_span_max  ...  \
0                NaN                NaN  ...
1                NaN                NaN  ...
2                NaN                NaN  ...
3                NaN                NaN  ...
4                NaN                NaN  ...

                                          Location 1 Community Board  \
0  50 Avenue\nX Brooklyn, NY 11223\n(40.589238098...            13.0
1  284 Baltic Street\nBrooklyn, NY 11201\n(40.685...             6.0
2  45 35 Van Dam Street\nLong Island City, NY 111...             2.0
3  509 West 129 Street\nNew York, NY 10027\n(40.8...             9.0
4  8 21 Bay 25 Street\nFar Rockaway, NY 11691\n(4...            14.0

  Council District Census Tract        BIN           BBL  \
0             47.0        308.0  3194998.0  3.071850e+09
1             33.0         69.0  3006401.0  3.004020e+09
2             26.0        179.0  4003442.0  4.002490e+09
3              7.0        219.0  1059723.0  1.019840e+09
4             31.0     100802.0  4300730.0  4.157360e+09

                                                 NTA     DBN        lat  \
0  Gravesend                                     ...  21K540  40.589238
1  DUMBO-Vinegar Hill-Downtown Brooklyn-Boerum Hi...  15K429  40.685452
2  Hunters Point-Sunnyside-West Maspeth          ...  24Q530  40.744150
3  Manhattanville                                ...  05M367  40.815230
4  Far Rockaway-Bayswater                        ...  27Q260  40.601989

         lon
0 -73.981747
1 -73.993491
2 -73.933627
3 -73.955201
4 -73.762834

[5 rows x 67 columns]


   ####  Create a new variable called class_size, and assign the value of data["class_size"] to it.
   ####  Filter class_size so the GRADE  column only contains the value 09-12. Note that the name of the GRADE  column has a space at the end; you'll generate an error if you don't include it.
  ####   Filter class_size so that the PROGRAM TYPE column only contains the value GEN ED.
  ####   Display the first five rows of class_size to verify.

In [28]:
#Condensing the Class Size Data Set
class_size = data["class_size"]
class_size = class_size[class_size["GRADE "] == "09-12"]
class_size = class_size[class_size["PROGRAM TYPE"] =="GEN ED"]
class_size.head()

,CSD,BOROUGH,SCHOOL CODE,SCHOOL NAME,GRADE,PROGRAM TYPE,CORE SUBJECT (MS CORE and 9-12 ONLY),CORE COURSE (MS CORE and 9-12 ONLY),SERVICE CATEGORY(K-9* ONLY),NUMBER OF STUDENTS / SEATS FILLED,NUMBER OF SECTIONS,AVERAGE CLASS SIZE,SIZE OF SMALLEST CLASS,SIZE OF LARGEST CLASS,DATA SOURCE,SCHOOLWIDE PUPIL-TEACHER RATIO,padded_csd,DBN
225,1,M,M292,Henry Street School for International Studies,09-12,GEN ED,ENGLISH,English 9,-,63.0,3.0,21.0,19.0,25.0,STARS,NaN,01,01M292
226,1,M,M292,Henry Street School for International Studies,09-12,GEN ED,ENGLISH,English 10,-,79.0,3.0,26.3,24.0,31.0,STARS,NaN,01,01M292
227,1,M,M292,Henry Street School for International Studies,09-12,GEN ED,ENGLISH,English 11,-,38.0,2.0,19.0,16.0,22.0,STARS,NaN,01,01M292
228,1,M,M292,Henry Street School for International Studies,09-12,GEN ED,ENGLISH,English 12,-,69.0,3.0,23.0,13.0,30.0,STARS,NaN,01,01M292
229,1,M,M292,Henry Street School for International Studies,09-12,GEN ED,MATH,Integrated Algebra,-,53.0,3.0,17.7,16.0,21.0,STARS,NaN,01,01M292


   #### Find the average values for each column associated with each DBN in class_size.
   ####     Use the pandas.DataFrame.groupby() method to group class_size by DBN.
   ####    Use the agg() method on the resulting pandas.core.groupby object, along with the numpy.mean() function as an argument, to calculate the average of each group.
   ####     Assign the result back to class_size.
   #### Reset the index to make DBN a column again.
   ####     Use the pandas.DataFrame.reset_index() method, along with the keyword argument inplace=True.
   ####    Assign class_size back to the class_size key of the data dictionary.
   ##### Display the first few rows of data["class_size"] to verify that everything went okay.

In [29]:
#Computing Average Class Sizes
import numpy as np

class_size = class_size.groupby('DBN').agg(np.mean)
class_size.reset_index(inplace = True)   
data["class_size"] = class_size
data["class_size"].head()

,DBN,CSD,NUMBER OF STUDENTS / SEATS FILLED,NUMBER OF SECTIONS,AVERAGE CLASS SIZE,SIZE OF SMALLEST CLASS,SIZE OF LARGEST CLASS,SCHOOLWIDE PUPIL-TEACHER RATIO
0,01M292,1,88.0000,4.000000,22.564286,18.50,26.571429,NaN
1,01M332,1,46.0000,2.000000,22.000000,21.00,23.500000,NaN
2,01M378,1,33.0000,1.000000,33.000000,33.00,33.000000,NaN
3,01M448,1,105.6875,4.750000,22.231250,18.25,27.062500,NaN
4,01M450,1,57.6000,2.733333,21.200000,19.40,22.866667,NaN



 ####   Filter demographics, only selecting rows in data["demographics"] where schoolyear is 20112012.
  ####      schoolyear is actually an integer, so be careful about how you perform your comparison.
  ####  Display the first few rows of data["demographics"] to verify that the filtering worked.

In [30]:
#Condensing the Demographics Data Set
data['demographics'] = data['demographics'][data['demographics']['schoolyear']== 20112012]
print(data['demographics'].head())

       DBN                                              Name  schoolyear  \
6   01M015  P.S. 015 ROBERTO CLEMENTE                           20112012
13  01M019  P.S. 019 ASHER LEVY                                 20112012
20  01M020  PS 020 ANNA SILVER                                  20112012
27  01M034  PS 034 FRANKLIN D ROOSEVELT                         20112012
35  01M063  PS 063 WILLIAM MCKINLEY                             20112012

   fl_percent  frl_percent  total_enrollment prek    k grade1 grade2  ...  \
6         NaN         89.4               189   13   31     35     28  ...
13        NaN         61.5               328   32   46     52     54  ...
20        NaN         92.5               626   52  102    121     87  ...
27        NaN         99.7               401   14   34     38     36  ...
35        NaN         78.9               176   18   20     30     21  ...

   black_num black_per hispanic_num hispanic_per white_num white_per male_num  \
6         63      33.3          109         57.7         4       2.1     97.0
13        81      24.7          158         48.2        28       8.5    147.0
20        55       8.8          357         57.0        16       2.6    330.0
27        90      22.4          275         68.6         8       2.0    204.0
35        41      23.3          110         62.5        15       8.5     97.0

   male_per female_num female_per
6      51.3       92.0       48.7
13     44.8      181.0       55.2
20     52.7      296.0       47.3
27     50.9      197.0       49.1
35     55.1       79.0       44.9

[5 rows x 38 columns]


   #### Filter graduation, only selecting rows where the Cohort column equals 2006.
   #### Filter graduation, only selecting rows where the Demographic column equals Total Cohort.
   #### Display the first few rows of data["graduation"] to verify that everything worked properly.

In [31]:
# Condensing the Graduation Data Set
data["graduation"] = data["graduation"][data["graduation"]["Cohort"] == "2006"]
data["graduation"] = data["graduation"][data["graduation"]["Demographic"] == "Total Cohort"]
print(data["graduation"].head())

     Demographic     DBN                            School Name Cohort  \
3   Total Cohort  01M292  HENRY STREET SCHOOL FOR INTERNATIONAL   2006
10  Total Cohort  01M448    UNIVERSITY NEIGHBORHOOD HIGH SCHOOL   2006
17  Total Cohort  01M450             EAST SIDE COMMUNITY SCHOOL   2006
24  Total Cohort  01M509                MARTA VALLE HIGH SCHOOL   2006
31  Total Cohort  01M515  LOWER EAST SIDE PREPARATORY HIGH SCHO   2006

    Total Cohort Total Grads - n  Total Grads - % of cohort Total Regents - n  \
3             78              43                       55.1                36
10           124              53                       42.7                42
17            90              70                       77.8                67
24            84              47                       56.0                40
31           193             105                       54.4                91

    Total Regents - % of cohort  Total Regents - % of grads  ...  \
3                          46.2                        83.7  ...
10                         33.9                        79.2  ...
17                         74.4                        95.7  ...
24                         47.6                        85.1  ...
31                         47.2                        86.7  ...

   Regents w/o Advanced - n  Regents w/o Advanced - % of cohort  \
3                        36                                46.2
10                       34                                27.4
17                       67                                74.4
24                       23                                27.4
31                       22                                11.4

    Regents w/o Advanced - % of grads Local - n  Local - % of cohort  \
3                                83.7         7                  9.0
10                               64.2        11                  8.9
17                               95.7         3                  3.3
24                               48.9         7                  8.3
31                               21.0        14                  7.3

    Local - % of grads Still Enrolled - n  Still Enrolled - % of cohort  \
3                 16.3                 16                          20.5
10                20.8                 46                          37.1
17                 4.3                 15                          16.7
24                14.9                 25                          29.8
31                13.3                 53                          27.5

    Dropped Out - n Dropped Out - % of cohort
3                11                      14.1
10               20                      16.1
17                5                       5.6
24                5                       6.0
31               35                      18.1

[5 rows x 23 columns]


   #### Convert each of the following columns in ap_2010 to numeric values using the pandas.to_numeric() function with the keyword argument errors="coerce".
   ####    AP Test Takers
   ####     Total Exams Taken
   ####     Number of Exams with scores 3 4 or 5
  ####  Display the column types using the dtypes attribute.

In [32]:
#Converting AP Test Scores
cols = ['AP Test Takers ','Total Exams Taken', 'Number of Exams with scores 3 4 or 5']
for col in cols:
    data["ap_2010"][col] = pd.to_numeric(data["ap_2010"][col],errors="coerce")
    
print(data["ap_2010"].dtypes)

DBN                                      object
SchoolName                               object
AP Test Takers                          float64
Total Exams Taken                       float64
Number of Exams with scores 3 4 or 5    float64
dtype: object


   #### Use the pandas pandas.DataFrame.merge() method to merge the ap_2010 data set into combined.
   ####     Make sure to specify how="left" as a keyword argument to indicate the correct join type.
   ####     Make sure to assign the result of the merge operation back to combined.
   #### Use the pandas df.merge() method to merge the graduation data set into combined.
   ####     Make sure to specify how="left" as a keyword argument to get the correct join type.
   ####    Make sure to assign the result of the merge operation back to combined.
   #### Display the first few rows of combined to verify that the correct operations occurred.
   #### Use the pandas.DataFrame.shape attribute to display the shape of the dataframe and see how many rows now exist.

In [33]:
# Performing the Left Joins

combined = data["sat_results"]
combined = combined.merge(data["ap_2010"], on="DBN", how="left")
combined = combined.merge(data["graduation"], on="DBN", how="left")
print(combined.head(5))
print(combined.shape)

      DBN                                    SCHOOL NAME  \
0  01M292  HENRY STREET SCHOOL FOR INTERNATIONAL STUDIES
1  01M448            UNIVERSITY NEIGHBORHOOD HIGH SCHOOL
2  01M450                     EAST SIDE COMMUNITY SCHOOL
3  01M458                      FORSYTH SATELLITE ACADEMY
4  01M509                        MARTA VALLE HIGH SCHOOL

  Num of SAT Test Takers  SAT Critical Reading Avg. Score  \
0                     29                            355.0
1                     91                            383.0
2                     70                            377.0
3                      7                            414.0
4                     44                            390.0

   SAT Math Avg. Score  SAT Writing Avg. Score  sat_score  \
0                404.0                   363.0     1122.0
1                423.0                   366.0     1172.0
2                402.0                   370.0     1149.0
3                401.0                   359.0     1174.0
4                433.0                   384.0     1207.0

                     SchoolName  AP Test Takers   Total Exams Taken  ...  \
0                           NaN              NaN                NaN  ...
1  UNIVERSITY NEIGHBORHOOD H.S.             39.0               49.0  ...
2        EAST SIDE COMMUNITY HS             19.0               21.0  ...
3                           NaN              NaN                NaN  ...
4                           NaN              NaN                NaN  ...

   Regents w/o Advanced - n Regents w/o Advanced - % of cohort  \
0                        36                               46.2
1                        34                               27.4
2                        67                               74.4
3                       NaN                                NaN
4                        23                               27.4

  Regents w/o Advanced - % of grads Local - n  Local - % of cohort  \
0                              83.7         7                  9.0
1                              64.2        11                  8.9
2                              95.7         3                  3.3
3                               NaN       NaN                  NaN
4                              48.9         7                  8.3

  Local - % of grads  Still Enrolled - n Still Enrolled - % of cohort  \
0               16.3                  16                         20.5
1               20.8                  46                         37.1
2                4.3                  15                         16.7
3                NaN                 NaN                          NaN
4               14.9                  25                         29.8

   Dropped Out - n  Dropped Out - % of cohort
0               11                       14.1
1               20                       16.1
2                5                        5.6
3              NaN                        NaN
4                5                        6.0

[5 rows x 33 columns]
(479, 33)


  ####  Merge class_size into combined. Then, merge demographics, survey, and hs_directory into combined one by one, in that order.
   ####    Be sure to follow the exact order above.
   ####    Remember to specify the correct column to join on, as well as the correct join type.
  ####  Display the first few rows of combined to verify that the correct operations occurred.
 ####  Use the pandas.DataFrame.shape attribute to display the shape of the dataframe to see how many rows now exist.

In [34]:
# Performing the Inner Joins

to_merge = ["class_size", "demographics", "survey", "hs_directory"]

for m in to_merge:
    combined = combined.merge(data[m], on="DBN", how="inner")

print(combined.head(5))
print(combined.shape)

      DBN                                        SCHOOL NAME  \
0  01M292      HENRY STREET SCHOOL FOR INTERNATIONAL STUDIES
1  01M448                UNIVERSITY NEIGHBORHOOD HIGH SCHOOL
2  01M450                         EAST SIDE COMMUNITY SCHOOL
3  01M509                            MARTA VALLE HIGH SCHOOL
4  01M539  NEW EXPLORATIONS INTO SCIENCE, TECHNOLOGY AND ...

  Num of SAT Test Takers  SAT Critical Reading Avg. Score  \
0                     29                            355.0
1                     91                            383.0
2                     70                            377.0
3                     44                            390.0
4                    159                            522.0

   SAT Math Avg. Score  SAT Writing Avg. Score  sat_score  \
0                404.0                   363.0     1122.0
1                423.0                   366.0     1172.0
2                402.0                   370.0     1149.0
3                433.0                   384.0     1207.0
4                574.0                   525.0     1621.0

                       SchoolName  AP Test Takers   Total Exams Taken  ...  \
0                             NaN              NaN                NaN  ...
1    UNIVERSITY NEIGHBORHOOD H.S.             39.0               49.0  ...
2          EAST SIDE COMMUNITY HS             19.0               21.0  ...
3                             NaN              NaN                NaN  ...
4  NEW EXPLORATIONS SCI,TECH,MATH            255.0              377.0  ...

   priority10                                         Location 1  \
0         NaN  220 Henry Street\nNew York, NY 10002\n(40.7137...
1         NaN  200 Monroe Street\nNew York, NY 10002\n(40.712...
2         NaN  420 East 12 Street\nNew York, NY 10009\n(40.72...
3         NaN  145 Stanton Street\nNew York, NY 10002\n(40.72...
4         NaN  111 Columbia Street\nNew York, NY 10002\n(40.7...

  Community Board Council District  Census Tract        BIN           BBL  \
0             3.0              1.0         201.0  1003223.0  1.002690e+09
1             3.0              1.0         202.0  1003214.0  1.002590e+09
2             3.0              2.0          34.0  1005974.0  1.004390e+09
3             3.0              1.0        3001.0  1004323.0  1.003540e+09
4             3.0              2.0        2201.0  1004070.0  1.003350e+09

                                                 NTA        lat        lon
0  Lower East Side                               ...  40.713764 -73.985260
1  Lower East Side                               ...  40.712332 -73.984797
2  East Village                                  ...  40.729783 -73.983041
3  Chinatown                                     ...  40.720569 -73.985673
4  Lower East Side                               ...  40.718725 -73.979426

[5 rows x 165 columns]
(363, 165)


   #### Calculate the means of all of the columns in combined using the pandas.DataFrame.mean() method.
  ####  Fill in any missing values in combined with the means of the respective columns using the pandas.DataFrame.fillna() method.
  ####  Fill in any remaining missing values in combined with 0 using the df.fillna() method.
  ####  Display the first few rows of combined to verify that the correct operations occurred.

In [35]:
# Filling in Missing Values
combined = combined.fillna(combined.mean())
combined = combined.fillna(0)

print(combined.head(5))

      DBN                                        SCHOOL NAME  \
0  01M292      HENRY STREET SCHOOL FOR INTERNATIONAL STUDIES
1  01M448                UNIVERSITY NEIGHBORHOOD HIGH SCHOOL
2  01M450                         EAST SIDE COMMUNITY SCHOOL
3  01M509                            MARTA VALLE HIGH SCHOOL
4  01M539  NEW EXPLORATIONS INTO SCIENCE, TECHNOLOGY AND ...

  Num of SAT Test Takers  SAT Critical Reading Avg. Score  \
0                     29                            355.0
1                     91                            383.0
2                     70                            377.0
3                     44                            390.0
4                    159                            522.0

   SAT Math Avg. Score  SAT Writing Avg. Score  sat_score  \
0                404.0                   363.0     1122.0
1                423.0                   366.0     1172.0
2                402.0                   370.0     1149.0
3                433.0                   384.0     1207.0
4                574.0                   525.0     1621.0

                       SchoolName  AP Test Takers   Total Exams Taken  ...  \
0                               0       129.028846         197.038462  ...
1    UNIVERSITY NEIGHBORHOOD H.S.        39.000000          49.000000  ...
2          EAST SIDE COMMUNITY HS        19.000000          21.000000  ...
3                               0       129.028846         197.038462  ...
4  NEW EXPLORATIONS SCI,TECH,MATH       255.000000         377.000000  ...

   priority10                                         Location 1  \
0           0  220 Henry Street\nNew York, NY 10002\n(40.7137...
1           0  200 Monroe Street\nNew York, NY 10002\n(40.712...
2           0  420 East 12 Street\nNew York, NY 10009\n(40.72...
3           0  145 Stanton Street\nNew York, NY 10002\n(40.72...
4           0  111 Columbia Street\nNew York, NY 10002\n(40.7...

  Community Board Council District  Census Tract        BIN           BBL  \
0             3.0              1.0         201.0  1003223.0  1.002690e+09
1             3.0              1.0         202.0  1003214.0  1.002590e+09
2             3.0              2.0          34.0  1005974.0  1.004390e+09
3             3.0              1.0        3001.0  1004323.0  1.003540e+09
4             3.0              2.0        2201.0  1004070.0  1.003350e+09

                                                 NTA        lat        lon
0  Lower East Side                               ...  40.713764 -73.985260
1  Lower East Side                               ...  40.712332 -73.984797
2  East Village                                  ...  40.729783 -73.983041
3  Chinatown                                     ...  40.720569 -73.985673
4  Lower East Side                               ...  40.718725 -73.979426

[5 rows x 165 columns]


   #### Write a function that extracts the first two characters of a string and returns them.
   #### Apply the function to the DBN column of combined, and assign the result to the school_dist column of combined.
   #### Display the first few items in the school_dist column of combined to verify the results.

In [37]:
# Adding a School District Column for Mapping

def get_first_two_chars(dbn):
    return dbn[0:2]

combined["school_dist"] = combined["DBN"].apply(get_first_two_chars)
print(combined["school_dist"].head())

0    01
1    01
2    01
3    01
4    01
Name: school_dist, dtype: object